/*
 Navicat MySQL Data Transfer

 Source Server         : 本地环境
 Source Server Version : 50613
 Source Host           : localhost
 Source Database       : Portal

 Target Server Version : 50613
 File Encoding         : utf-8

 Date: 10/18/2013 22:26:00 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `Announce`
-- ----------------------------
DROP TABLE IF EXISTS `Announce`;
CREATE TABLE `Announce` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(200) NOT NULL,
  `description` varchar(500) DEFAULT NULL,
  `url` varchar(200) DEFAULT NULL,
  `addTime` datetime NOT NULL,
  `updateTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `Announce`
-- ----------------------------
BEGIN;
INSERT INTO `Announce` VALUES ('1', '1', '1', '11', '2013-09-21 19:00:37', '2013-09-21 19:00:40'), ('2', '2', '2', '22', '2013-10-06 22:49:49', '2013-10-06 22:49:52'), ('3', 'nihao', '', '', '2013-10-07 00:00:00', '2013-10-07 09:00:40'), ('4', '12312', null, null, '2013-10-07 09:05:02', null), ('5', '1313', null, null, '2013-10-07 09:05:15', null), ('6', '123123', null, null, '2013-10-07 09:05:24', null), ('7', '123123', null, null, '2013-10-07 09:05:39', null), ('8', '12312312', null, null, '2013-10-07 09:05:48', null), ('9', 'fwef', null, null, '2013-10-07 09:05:56', null), ('10', ' saf as ', null, null, '2013-10-07 09:06:03', null), ('11', 'asdf as f', null, null, '2013-10-07 09:06:12', null), ('12', 'asdfsdfsdf', null, null, '2013-10-07 09:06:19', null), ('13', 'asdfasdfadsf', null, null, '2013-10-07 09:06:27', null), ('14', 'asdfasfsfasfsf', null, null, '2013-10-07 09:06:36', null), ('15', 'asdfsaf123123', null, null, '2013-10-07 09:06:49', null), ('16', 'nihao13123', '', '123123123123', '2013-10-07 00:00:00', '2013-10-07 11:24:16'), ('17', 'nihao', '', '', '2013-10-07 00:00:00', '2013-10-07 09:31:11'), ('18', 'nihao', '', '', '2013-10-07 00:00:00', '2013-10-07 09:31:41'), ('19', 'ä½ å¥½å', null, 'http://wwasfasf.com', '2013-10-07 00:00:00', null), ('20', 'good', null, 'sd发', '2013-10-07 00:00:00', null), ('21', '123', null, 'asfdaf', '2013-10-07 00:00:00', null), ('22', 'asdf', null, 'asdf', '2013-10-13 00:00:00', null), ('23', 'nihao', null, 'www.baidu.com', '2013-10-13 00:00:00', '2013-10-13 22:03:30'), ('24', '123', null, '1231', '2013-10-18 00:00:00', '2013-10-18 13:33:14'), ('25', '1212', null, '1212', '2013-10-18 00:00:00', '2013-10-18 13:34:17'), ('26', '123123', null, '121111111111', '2013-10-18 00:00:00', '2013-10-18 13:37:23'), ('27', '1313311111111111111111111', null, '123123', '2013-10-18 00:00:00', '2013-10-18 13:37:56');
COMMIT;

-- ----------------------------
--  Table structure for `Document`
-- ----------------------------
DROP TABLE IF EXISTS `Document`;
CREATE TABLE `Document` (
  `DocumentId` int(11) NOT NULL AUTO_INCREMENT,
  `Type` varchar(100) NOT NULL COMMENT '1:新闻2专家门诊',
  `isTop` tinyint(4) NOT NULL DEFAULT '0',
  `isDelete` tinyint(4) DEFAULT '1',
  `title` varchar(200) NOT NULL,
  `addTime` datetime DEFAULT NULL,
  `updateTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `content` text,
  `description` varchar(500) DEFAULT NULL,
  `memo` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`DocumentId`)
) ENGINE=InnoDB AUTO_INCREMENT=1488 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `Document`
-- ----------------------------
BEGIN;
INSERT INTO `Document` VALUES ('1', '新闻资讯', '0', '1', '1', '2013-09-14 13:57:49', '2013-09-21 14:53:31', '<p>1</p>\r\n', '1', '1'), ('2', '新闻资讯', '2', '1', '2', '2013-09-14 17:08:38', '2013-09-21 14:52:02', '2', '2', '2'), ('3', '新闻资讯', '3', '1', '3', '2013-09-14 17:08:59', '2013-09-21 14:51:59', '3', '3', '3'), ('4', '新闻资讯', '1', '1', '12', '2013-09-19 10:00:59', '2013-09-21 14:51:57', 'iji', 'bn', 'nnj'), ('5', '新闻资讯', '0', '1', 'i am nw', '2013-09-19 00:00:00', '2013-09-21 14:51:54', '<p>asfs&nbsp;<s>asdfas&nbsp;</s></p>\r\n', null, null), ('6', '新闻资讯', '1', '1', '1', '2013-09-19 10:23:01', '2013-09-21 14:51:53', '2', null, null), ('1313', '新闻资讯', '1', '1', '1', '2013-09-25 10:24:08', '2013-09-21 14:51:51', '12', '1212', '12'), ('1314', '新闻资讯', '0', '1', 'i am feifei', '2013-09-19 00:00:00', '2013-09-21 14:51:50', '<p>afa<s>sdfasdfasdfsad</s></p>\r\n', null, null), ('1315', '新闻资讯', '0', '1', 'i am feifei', '2013-09-19 00:00:00', '2013-09-21 14:51:49', '<p>afa<s>sdfasdfasdfsad</s></p>\r\n', null, null), ('1316', '新闻资讯', '1', '1', 'i am feifei', '2013-09-19 00:00:00', '2013-09-21 14:51:48', '<p><s>nihaonihao&nbsp;</s><s>&nbsp;&nbsp;nihao&nbsp;</s></p>\r\n', null, null), ('1317', '新闻资讯', '1', '1', 'I am a title', '2013-09-19 00:00:00', '2013-09-21 14:51:46', '<p><s>wenzhang</s></p>\r\n', null, null), ('1318', '新闻资讯', '1', '1', 'I am title1', '2013-09-19 00:00:00', '2013-09-21 14:51:45', '<p>welafasf</p>\r\n', null, null), ('1422', '新闻资讯', '1', '1', '中国文章', '2013-09-19 19:41:02', '2013-09-21 14:51:44', '中国', null, null), ('1423', '新闻资讯', '1', '1', 'æ??æ?¯æ ?é¢?', '2013-09-19 00:00:00', '2013-09-21 14:51:43', '<p>zå®?è§?</p>\r\n', null, null), ('1424', '新闻资讯', '1', '1', 'ç»?å½?22', '2013-09-19 00:00:00', '2013-09-21 14:51:41', '<p>å??æ?¢</p>\r\n', null, null), ('1425', '新闻资讯', '1', '1', 'ä¸­å½äºº', '2013-09-19 00:00:00', '2013-09-21 14:51:39', '<p>ææ¯ä¸ä¸ªå¤§åèãã<s>åå</s></p>\r\n', null, null), ('1426', '新闻资讯', '1', '1', 'ä¸­å½äºº', '2013-09-19 00:00:00', '2013-09-21 14:51:38', '<p>aæ¯ç­åèæç</p>\r\n', null, null), ('1427', '新闻资讯', '1', '1', '中国老婆', '2013-09-19 00:00:00', '2013-09-21 14:51:36', '<p>aæ¯ç­åèæç</p>\r\n', null, null), ('1428', '新闻资讯', '0', '1', '中国老婆', '2013-09-19 00:00:00', '2013-09-21 14:50:53', '<p>我是点评人</p>\r\n', null, null), ('1429', '专家门诊', '1', '1', '12313', '2013-09-20 00:00:00', '2013-09-20 00:09:48', '<p>a是否</p>\r\n', null, null), ('1430', '专家门诊', '1', '1', '12313', '2013-09-26 00:00:00', '2013-09-20 00:21:40', '<p>a是否</p>\r\n', null, null), ('1431', '专家门诊', '0', '1', '12313', '2013-09-26 00:00:00', '2013-09-20 00:25:10', '<p>a是否</p>\r\n', null, null), ('1432', '新闻资讯', '1', '1', '菲菲是个小傻姑', '2013-09-20 00:00:00', '2013-09-21 14:50:56', '<p>a斯蒂芬</p>\r\n', null, null), ('1433', '新闻资讯', '0', '1', '南京农业大学梨网', '2013-09-20 00:00:00', '2013-09-20 13:36:47', '<blockquote>\r\n<hr />\r\n<hr />\r\n<hr />\r\n<h1 style=\"background-color: rgb(238, 238, 238); border: 1px solid rgb(204, 204, 204); padding: 5px 10px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 中国人是个</h1>\r\n\r\n<p>你好啊啊</p>\r\n</blockquote>\r\n', null, null), ('1434', '新闻资讯', '0', '1', '菲菲。。。', '2013-09-20 00:00:00', '2013-09-21 14:51:01', '<h1>a &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;速度发顺风阿萨德阿萨德</h1>\r\n\r\n<p>中国人</p>\r\n\r\n<p><img alt=\"\" src=\"http://mt1.baidu.com/timg?wh_rate=0&amp;wapiknow&amp;quality=30&amp;size=340&amp;sec=0&amp;di=6c430ceb83d6d7bb270c43e95e0a26b7&amp;src=http://img.baidu.com/img/iknow/r/image/2013-09-19/0d3456be26a1d60642b45598d10eeca8.jpg\" /></p>\r\n', null, null), ('1435', '新闻资讯', '0', '1', '测试', '2013-09-20 00:00:00', '2013-09-20 14:19:51', '<p>a斯蒂芬</p>\r\n', null, null), ('1436', '新闻资讯', '0', '1', '测试111', '2013-09-20 00:00:00', '2013-09-21 14:51:06', '', null, null), ('1437', '新闻资讯', '0', '1', '策士2', '2013-09-20 00:00:00', '2013-09-21 14:51:08', '<p>a说的发生</p>\r\n', null, null), ('1438', '新闻资讯', '0', '1', '测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度测试标题长度长度', '2013-09-20 00:00:00', '2013-09-21 14:51:09', '', null, null), ('1439', '新闻资讯', '0', '1', 'i am feifei', '2013-09-08 00:00:00', '2013-09-21 14:51:10', '', null, null), ('1440', '新闻资讯', '0', '1', 'i am feifei', '2013-09-08 00:00:00', '2013-09-21 14:51:11', '<p>1231413123124123</p>\r\n', null, null), ('1441', '新闻资讯', '0', '1', '我是一个更改了的标题', '2013-09-26 00:00:00', '2013-09-21 14:51:13', '<p>a斯蒂芬说句更改成功了</p>\r\n', null, null), ('1442', '新闻资讯', '0', '1', 'test', '2013-09-21 00:00:00', '2013-09-21 15:00:43', '<p>asfasdf</p>\r\n', null, null), ('1443', '新闻资讯', '0', '1', 'ceshi', '2013-09-21 00:00:00', '2013-09-21 15:06:22', '', null, null), ('1444', '新闻资讯', '0', '1', 'asdf', '2013-09-21 00:00:00', '2013-09-21 15:08:22', '', null, null), ('1445', '新闻资讯', '0', '1', 'asdf', '2013-09-21 00:00:00', '2013-09-21 15:08:33', '', null, null), ('1446', '新闻资讯', '0', '1', '12', '2013-09-21 00:00:00', '2013-09-21 15:08:43', '', null, null), ('1447', '新闻资讯', '0', '1', 'ads', '2013-09-21 00:00:00', '2013-09-21 15:08:53', '<p>asdf</p>\r\n', null, null), ('1448', '新闻资讯', '0', '1', '我是一个标题', '2013-09-21 00:00:00', '2013-09-21 15:09:06', '', null, null), ('1449', '新闻资讯', '0', '1', '11111', '2013-10-01 00:00:00', '2013-10-01 11:44:12', '<p>aasaf</p>\r\n', null, null), ('1450', '新闻资讯', '0', '1', '11111', '2013-10-25 00:00:00', '2013-10-01 11:47:18', '<p>agfasfas</p>\r\n', null, null), ('1451', '新闻资讯', '0', '1', '11111', '2013-10-18 00:00:00', '2013-10-01 11:49:28', '<p>ll</p>\r\n', null, null), ('1452', '新闻资讯', '0', '1', '11111', '2013-10-15 00:00:00', '2013-10-01 11:52:36', '<p>mkmk</p>\r\n', null, null), ('1453', '新闻资讯', '0', '1', '11111', '2013-10-31 00:00:00', '2013-10-06 22:16:32', '<p>hello easy ui!</p>\r\n', null, null), ('1454', '新闻资讯', '0', '1', '2222', '2013-10-06 00:00:00', '2013-10-06 22:19:49', '<p>gvgvg</p>\r\n', null, null), ('1455', '新闻资讯', '0', '1', '2222', '2013-10-06 00:00:00', '2013-10-06 23:37:57', '<p>xss</p>\r\n', null, null), ('1456', '新闻资讯', '0', '1', '11111', '2013-10-06 00:00:00', '2013-10-06 23:44:24', '', null, null), ('1457', '新闻资讯', '0', '1', '2222', '2013-10-06 00:00:00', '2013-10-06 23:48:29', '', null, null), ('1458', '新闻资讯', '0', '1', '123', '2013-10-13 00:00:00', '2013-10-13 20:06:57', '<p>sfasf</p>\r\n', null, null), ('1459', '新闻资讯', '0', '0', '`', '2013-10-13 00:00:00', '2013-10-18 19:30:02', '<p>asdf</p>\r\n', null, null), ('1460', '新闻资讯', '0', '1', '123', '2013-10-13 00:00:00', '2013-10-13 21:46:28', '<p><img alt=\"\" src=\"uploads/20131013214449.png\" /></p>\r\n', null, null), ('1461', '新闻资讯', '0', '1', '123123', '2013-10-17 00:00:00', '2013-10-18 11:05:58', '<p>asdfniha你好</p>\r\n\r\n<h2 style=\"font-style:italic;\">阿萨德发斯蒂芬&nbsp;</h2>\r\n', null, null), ('1462', 'æ°é»èµè®¯', '0', '1', 'asdf', '2013-10-17 00:00:00', '2013-10-18 10:55:37', '<h1><em><strong>asdfasdfasdf asdf a&nbsp;</strong></em>asdf</h1>\r\n\r\n<p>å äºä¸è¡</p>\r\n', null, null), ('1463', '专家门诊', '0', '1', '123', '2013-10-17 00:00:00', '2013-10-17 20:35:08', '<h1>asf a</h1>\r\n', null, null), ('1464', 'æ°é»èµè®¯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 09:57:10', '<p>safds&nbsp;</p>\r\n', null, null), ('1465', '新闻资讯', '0', '1', '123123123', '2013-10-18 00:00:00', '2013-10-18 11:10:53', '<p>asdfasdf</p>\r\n', null, null), ('1466', '新闻资讯', '0', '1', '测试ie中访问', '2013-10-18 00:00:00', '2013-10-18 11:18:38', '<h1>我是</h1>\r\n\r\n<h2>我是正文二</h2>\r\n', null, null), ('1467', '新闻资讯', '0', '1', '阿萨德发', '2013-10-18 00:00:00', '2013-10-18 11:21:42', '<p>a斯蒂芬</p>\r\n\r\n<p>nihao</p>\r\n', null, null), ('1468', '新闻资讯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:25:11', '<p>a上帝发誓</p>\r\n', null, null), ('1469', '新闻资讯', '0', '1', '123', '2013-10-18 00:00:00', '2013-10-18 11:30:52', '<p>asdf</p>\r\n', null, null), ('1470', '新闻资讯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:46:47', '<p>123123asdf</p>\r\n\r\n<p>asdfasdf</p>\r\n', null, null), ('1471', '新闻资讯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:53:43', '<p>123123asdf</p>\r\n\r\n<p>asdfasdf</p>\r\n', null, null), ('1472', '新闻资讯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:53:52', '<p>123123asdf</p>\r\n\r\n<p>asdfasdf</p>\r\n', null, null), ('1473', '新闻资讯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:54:26', '<p>123123asdf</p>\r\n\r\n<p>asdfasdf</p>\r\n', null, null), ('1474', 'æ°é»èµè®¯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 11:57:36', '<p>123123asdf</p>\r\n\r\n<p>asdfasdf</p>\r\n', null, null), ('1475', 'ä¸å®¶é¨è¯', '0', '1', '123123', '2013-10-18 00:00:00', '2013-10-18 12:17:38', '<p>123123</p>\r\n', null, null), ('1476', 'æ°é»èµè®¯', '0', '1', '121123', '2013-10-18 00:00:00', '2013-10-18 12:18:36', '<p>1111</p>\r\n', null, null), ('1477', 'æ°é»èµè®¯', '0', '1', '121123', '2013-10-18 00:00:00', '2013-10-18 12:20:03', '<p>1111</p>\r\n', null, null), ('1478', 'æ°é»èµè®¯', '0', '1', '121123', '2013-10-18 00:00:00', '2013-10-18 12:23:23', '<p>1111</p>\r\n', null, null), ('1479', 'æ°é»èµè®¯', '0', '1', '12112311111111', '2013-10-18 00:00:00', '2013-10-18 12:24:09', '<p>1111</p>\r\n', null, null), ('1480', 'ä¸å®¶é¨è¯', '0', '1', '123', '2013-10-18 00:00:00', '2013-10-18 12:47:12', '<p>123123</p>\r\n', null, null), ('1481', '技术简报', '0', '1', '添加文字', '2013-10-18 00:00:00', '2013-10-18 12:49:09', '<h1>我是正文</h1>\r\n\r\n<p>我换了一个module</p>\r\n', null, null), ('1482', '专家门诊', '0', '1', '这是一个文章标题1', '2013-10-18 00:00:00', '2013-10-18 18:33:21', '<h2 style=\"font-style:italic;\">测试文章内容添加sa</h2>\r\n', null, null), ('1483', '新闻资讯', '0', '1', '我是一个从首页添加的留言', '2013-10-18 00:00:00', '2013-10-18 19:56:07', '<h2 style=\"font-style:italic;\">h啊哈</h2>\r\n', null, null), ('1484', '留言板', '0', '1', '留言2', '2013-10-18 00:00:00', '2013-10-18 20:03:51', '<h2 style=\"font-style:italic;\">a斯蒂芬</h2>\r\n', null, 'csophsy'), ('1485', '留言板', '0', '1', '留言3', '2013-10-18 00:00:00', '2013-10-18 20:03:57', '<p>这是第三个留言</p>\r\n', null, 'feifei'), ('1486', '留言板', '0', '1', '留言3', '2013-10-18 00:00:00', '2013-10-18 20:04:03', '<p>这是第三个留言</p>\r\n', null, 'ceshi'), ('1487', '留言板', '0', '1', '普通用户添加留言', '2013-10-18 00:00:00', '2013-10-18 20:09:22', '<p>会有用户信息</p>\r\n', null, 'adminadmin');
COMMIT;

-- ----------------------------
--  Table structure for `Image`
-- ----------------------------
DROP TABLE IF EXISTS `Image`;
CREATE TABLE `Image` (
  `imageId` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(200) NOT NULL,
  `imageTag` varchar(100) DEFAULT NULL,
  `imageUrl` varchar(500) DEFAULT NULL,
  `isShowOnIndex` tinyint(4) NOT NULL DEFAULT '0',
  `filePath` varchar(200) DEFAULT NULL,
  `addTime` datetime NOT NULL,
  `updateTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `memo` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`imageId`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `Image`
-- ----------------------------
BEGIN;
INSERT INTO `Image` VALUES ('12', '这是一个标题', 'default', 'www.baidu.com', '0', '/Users/csophys/Documents/tempFile/20131013200322.png', '2013-10-13 00:00:00', null, null), ('13', '这是一个标题', 'default', 'www.baidu.com', '0', '/Users/csophys/Documents/tempFile/20131013200322.png', '2013-10-13 00:00:00', null, null), ('14', 'asdf', 'default', 'asf', '1', '/Users/csophys/Documents/tempFile/20131013200718.png', '2013-10-13 00:00:00', null, null), ('15', 'asdf', 'default', 'asdf', '1', '/Users/csophys/Documents/tempFile/20131013201018.png', '2013-10-13 00:00:00', null, null), ('16', '测试图片', 'default', '', '0', '', '2013-10-13 00:00:00', null, null), ('17', 'asdf', 'default', 'bhh', '1', '/Users/csophys/Documents/tempFile/20131013201726.png', '2013-10-13 00:00:00', null, null), ('18', 'test', 'default', '', '1', '/Users/csophys/Documents/tempFile/20131013201809.png', '2013-10-13 00:00:00', null, null), ('19', '111', 'default', 'www.baidu.com', '1', '/Users/csophys/Documents/tempFile/20131013201834.png', '2013-10-13 00:00:00', null, null), ('20', '测试图片', 'default', 'www.baidu.com', '1', 'uploads/20131013213556.png', '2013-10-13 00:00:00', null, null), ('21', '测试图片', 'default', 'asdf', '1', 'uploads/20131013213845.png', '2013-10-13 00:00:00', null, null), ('22', 'test', 'default', 'www.baidu.com', '1', '', '2013-10-13 00:00:00', null, null), ('23', '测试图片', 'default', 'asdf', '1', 'uploads/20131013214449.png', '2013-10-13 00:00:00', null, null), ('24', '测试图片', 'default', 'asdf', '1', 'uploads/20131013214449.png', '2013-10-13 00:00:00', null, null), ('25', '测试图片', 'default', 'asdf', '1', 'uploads/20131013214449.png', '2013-10-13 00:00:00', null, null), ('26', '测试图片', 'default', 'www.baidu.com', '1', 'uploads/20131013215554.png', '2013-10-13 00:00:00', null, null), ('27', '测试图片', 'default', 'www.baidu.com', '1', 'uploads/20131013215728.png', '2013-10-13 00:00:00', '2013-10-13 21:57:30', null), ('28', '123', 'default', '123', '1', 'uploads/20131018113153.gif', '2013-10-18 00:00:00', '2013-10-18 11:31:55', null), ('29', '1', 'default', '', '1', 'uploads/20131018192333.jpg', '2013-10-18 00:00:00', '2013-10-18 19:23:37', null), ('30', '2', 'default', '', '1', 'uploads/20131018192355.jpg', '2013-10-18 00:00:00', '2013-10-18 19:23:57', null), ('31', '4', 'default', '', '0', 'uploads/20131018192411.jpg', '2013-10-18 00:00:00', '2013-10-18 19:24:12', null);
COMMIT;

-- ----------------------------
--  Table structure for `User`
-- ----------------------------
DROP TABLE IF EXISTS `User`;
CREATE TABLE `User` (
  `userId` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(200) NOT NULL,
  `password` varchar(50) NOT NULL,
  `powerCode` tinyint(4) DEFAULT NULL COMMENT '1:系统管理员 2普通用户',
  PRIMARY KEY (`userId`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `User`
-- ----------------------------
BEGIN;
INSERT INTO `User` VALUES ('1', 'admin', 'njauadmin', '1'), ('2', 'csophys', 'haha', '0'), ('3', '11111', '111111', null), ('4', '12345', '123456', null), ('5', '123456', '123456', null), ('6', 'adminadmin', 'adminadmin', null);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
