// 订单状态
var ORDER_STATUS_MAP = {
	'0' : '等待付款',
	'1' : '交易成功',
	'2' : '已取消',
	'3' : '已付款但购买失败',
	'-1' : '错误状态'
};

// 退款状态
var REFUND_STATUS_MAP = {
	'0' : '无退款',
	'1' : '退款申请中',
	'2' : '退款处理中',
	'3' : '退款成功',
	'4' : '退款未批准',
	'-1' : '错误状态'
};

// 券状态
var RECEIPT_STATUS_MAP = {
	'0' : '未使用',
	'1' : '已使用',
	'2' : '退券中',
	'3' : '已退券',
	'4' : '部分退券',
	'5' : '部分使用',
	'-1' : '错误状态'
};

// 支付状态
var PAYMENT_CHANNEL = {
	'0' : '支付宝',
	'1' : '支付宝 ',
	'2' : '点评余额',
	'3' : '支付宝WAP',
	'4' : '银联',
	'5' : '支付宝App',
	'6' : '支付宝ONEKEY',
	'7' : '联动优势',
	'8' : '招行直连',
	'9' : '财付通',
	'10' : '快钱'
};

// 支付流水的支付类型
var USER_ACCOUNT_AUDIT_TYPE_MAP = {
	'-1' : '错误类型',
	'11' : '购买',
	'12' : '购买取消',
	'21' : '单纯充值',
	'22' : '单纯充值退款到第三方',
	'23' : '消费充值',
	'24' : '消费充值退款到第三方',
	'31' : '红包返利',
	'32' : '评价返利',
	'33' : '购买返利',
	'34' : '邀请返利',
	'35' : '活动返利',
	'36' : '消费代码',
	'37' : '抵用券',
	'38' : '礼品卡',
	'39' : '抵扣券作废',
	'40' : '优惠代码作废',
	'51' : '人工补款',
	'52' : '提现'
};

// 电影在线预订状态
var MOVIE_STATUS_MAP = {
	'0' : '未出票 ',
	'1' : '出票成功',
	'2' : '出票失败',
	'-1' : '错误状态'
};

// 优惠代码状态
var COUPON_CODE_STATUS_MAP = {
	'0' : '未使用',
	'1' : '已使用',
};

// 支付平台状态
var PAY_PLATFORM = {
	'0' : "未知",
	'10000000' : "未知",
	'10010100' : "电脑网页",
	'10030100' : "内部系统",
	'20010100' : "手机网页",
	'20010200' : "手机网页",
	'20010300' : "手机客户端",
	'20010400' : "手机客户端",
	'20010500' : "手机客户端",
	'20010600' : "手机客户端",
	'20020100' : "手机网页",
	'20020200' : "手机网页",
	'20020300' : "手机网页",
	'20020400' : "手机客户端",
	'20020500' : "手机客户端",
	'20020600' : "手机客户端",
	'30020100' : "ipad网页",
	'30020400' : "ipad客户端",
	'40010100' : "第三方",
	'50010100' : "手机网页",
	'50010200' : "手机M站",
};

// 业务类型
var PRODUCT_CODE = {
	'tuangou' : "1",
	'movie' : "3"
};

// 部门名称
var DEPARTMENT_MAP = {
	'0' : '主站运营',
	'1' : '团购运营',
	'2' : '手机运营',
	'3' : '社区运营',
	'4' : '信息运营',
	'5' : '市场部',
	'6' : '其他',
};

var USER_ACCOUNT_MAP = {
	'-1' : '错误状态',
	'0' : '正常',
	'1' : '屏蔽'
};
